<template>
    <div class="about__us">
      <div class="online">
        <h2>Про нас</h2>
        <p>
          "Третій Поверх" був створений у 2024 році, через два роки після
          початку повномасштабного вторгнення російскої армії на територію
          України. Центр був заснован українцями для українців з метою підтримки
          психоемоційного стану громадян у складні часи, оздоровлення наших
          військових, та вирішення повсякденних проблем кожного, хто потребує
          допомоги.
        </p>
        <h2>Наша ціль</h2>
        <p>
          Ми поставили собі ціль не просто зібрати команду спеціалістів, а
          створити простір, де ви будете відчувати себе у безпеці та зможете
          стати частиною спільноти, де з розумінням ставляться до почуттів та
          думок.
        </p>
        <h2>Наша мета</h2>
        <p>
          Головна наша мета - це задовільнити ваші потреби та зробити це
          найшвидшим шляхом. Ми розуміємо наскільки ніщівні емоції доводиться
          відчувати в часи, коли більшість переживаннь викликані зовнішніми
          чинниками, а внутрішного ресурсу може банально не вистачати на те, щоб
          впоратися з усіма проблемами самотужки. Ви не самотні у своїх
          переживаннях. Велика кількість людей по всій Україні стикається з
          подібними проблемами та по мірі своїх сил справляється з їх
          вирішенням. Наведена статистика та відомі стратегії, які дозволяють
          подолати будь-яку проблему, з якою звертаються по допомогу до
          психолога.
        </p>
        <h2>Наші цінності</h2>
        <p>
          Ми будемо з розумінням ставитися до вашого запиту, аналізувати
          емоційний стан та працювати над тим, щоб змінити його на кращій,
          керуючись перевіреним технікам. Ви можете бути впевнені — у вас є
          ресурс для того, щоб вирішити усе, що вас непокоїть, а наша команда
          допоможе вам на цьому шляху. Усе що ви почуєте під час консультації,
          як і методи, які будуть використовуватися, ви можете знайти у наукових
          роботах, або навіть дізнатися з популярних книжок. Сертифікований
          спеціаліст знайомий з переважною більшістю матеріалу, що стосується
          його спеціалізації, пройшов відповідне навчання та має великий досвід
          з вирішення подібних проблем, тому знає, що з написаного працює, а що
          — ні. Він прочитав і проаналізував ці ідеї за вас та перевірив
          ефективні методи на практиці, щоб ви мали змогу не витрачати на це
          свій час, а одразу отримали кваліфіковану допомогу. На першій
          консультації ми розповимо, як буде проходити терапія і ви можете бути
          спокійні — ми знаємо що робимо.
        </p>
        <br>
        <p>
          Запрошуємо вас зробити перший крок до кращого життя разом з нами.
          Зв'яжіться з нами сьогодні, щоб записатися на консультацію або
          дізнатися більше про наші послуги.
        </p>
        <br>
        <p>Ваше благополуччя — наша найвища цінність.</p>
      </div>
    </div>
</template>

<script>
import { defineComponent, onMounted } from 'vue';

export default defineComponent({
  name: 'AboutUS',
  mounted() {
    const burgerMenu = document.getElementById("burgerMenu");
      const menuOverlay = document.getElementById("menuOverlay");

      const toggleMenu = () => {
        menuOverlay.classList.toggle("open");
        burgerMenu.classList.toggle("open");
      };

      burgerMenu.addEventListener("click", toggleMenu);
      function checkTimeAndHideMessages() {
        const now = new Date();
        const currentHour = now.getHours();

        const elements = document.querySelectorAll(".message.operator");

        if (currentHour >= 20 || currentHour < 9) {
          elements.forEach((element) => {
            element.style.display = "none";
          });
        } else {
          elements.forEach((element) => {
            element.style.display = "";
          });
        }
      }

      checkTimeAndHideMessages();

      setInterval(checkTimeAndHideMessages, 60000);
  }
})
</script>

<style lang="scss" scoped>


</style>
