<template>
    <div class="ban_pr">
      <div class="banner-selection">
        <div class="container">
          <div class="banner-selection__banner">
            <div class="banner-selection__banner__text">
              <div class="span_banner">
                <span>Перша консультація безкоштовна</span>
              </div>
              <p class="banner_text1">
                Під час першої зустрічі ви можете як розповісти про те, що
                викликає найбільше занепокоєння в житті, та те, як це впливає на
                ваші почуття та поведінку, так і просто провести час у
                безпечному просторі де вас підтримають та зрозуміють.
              </p>
              <a href="signUp.html" class="btn-selection">Залишити заявку</a>
            </div>
            <div class="banner-selection__img">
              <img class="lazyload" src="../assets/img/banner2.svg" alt="" />
            </div>
          </div>
        </div>
      </div>
      <div class="wave-box">
        <svg
          class="wave"
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 1440 160"
        >
          <path
            fill="#fdf7f1"
            fill-opacity="1"
            d="M0,96L60,101.3C120,106.5,240,117.5,360,106.7C480,96,600,64,720,61.3C840,58.5,960,85.5,1080,93.3C1200,101.5,1320,90.5,1380,85.3L1440,80L1440,160L1380,160C1320,160,1200,160,1080,160C960,160,840,160,720,160C600,160,480,160,360,160C240,160,120,160,60,160L0,160Z"
          ></path>
        </svg>
      </div>
    </div>
    <div class="pr">
      <div class="block_pr">
        <div class="pr_lft">
          <img src="../assets/img/personal.svg" alt="child" />
          <h5>Спеціаліст: 1 300 грн</h5>
          <h5>Провідний спеціаліст: 1 800 грн</h5>
          <h3>Тривалість консультації: 55 хв</h3>
        </div>
        <div class="pr_rght">
          <h4>Індивідуальна терапія</h4>
          <div class="pr_lft_none">
            <img src="../assets/img/personal.svg" alt="child" />
            <h5>Спеціаліст: 1 300 грн</h5>
            <h5>Провідний спеціаліст: 1 800 грн</h5>
            <h3>Тривалість консультації: 55 хв</h3>
          </div>
          <p>
            Терапія з психологом стає все більш актуальною у сучасному світі, де
            дуже багато стресу та непередбачуваних подій. Іноді просто не
            вистачає сил на те, щоб гармонійно поєднувати спілкування з родиною
            та друзями, роботу і особисте життя, але професійна підтримка може
            допомогти віднайти втрачений баланс і досягти бажаного результату.
          </p>
          <div class="sp">
            <span>Довіра до психолога та процесу терапії</span>
          </div>
          <p>
            Побудова довірливих відносин між вами і психологом дає можливість
            відкрито ділитися своїми думками та почуттями, не остарігаючись
            осуду чи критики. Психолог слухає уважно та без упередження, і
            допомагає вам краще зрозуміти себе та свою поведінку у різних
            ситуаціях.
          </p>
          <div class="sp">
            <span>Робота з думками та емоціями</span>
          </div>
          <p>
            Під час консультації з психологом ви можете детально розповісти про
            свої думки та емоції і зрозуміти, чому вони виникають та як
            впливають на ваше життя. Їх подальший аналіз дозволяє не лише
            виявити причину внутрішного конфлікту, але й знайти ефективний
            спосіб для його вирішення. Психолог допомагає розробити стратегії,
            що дозволять вам позбутися тривожних думок і навчитися справлятися
            зі стресом, пропрацювати травматичні події та адаптуватися до нових
            умов життя, впоратись з втратою і горем, налагодити стосунки з
            рідними, знайти сенс життя та повернути радість.
          </p>
          <div class="sp">
            <span>Розвиток навичок саморегуляції та емоційного інтелекту</span>
          </div>
          <p>
            Один з ключових аспектів індивідуальної терапії полягає у розвитку
            навичок саморегуляції та емоційного інтелекту. Це може включати
            навчання методам релаксації, покращення навичок комунікації і
            встановлення здорових меж у взаєминах з іншими людьми. Все це сприяє
            покращенню загального психоемоційного стану та підвищує якість
            життя.
          </p>
          <div class="sp">
            <span>Інвестиція у себе та своє майбутнє</span>
          </div>
          <p>
            Індивідуальна терапія з психологом – це інвестиція у себе і своє
            майбутнє. Терапія допомагає знайти нові перспективи, відкрити
            внутрішній потенціал і жити більш повноцінним та щасливим життям.
            Кожна сесія – це крок до гармонії з собою та навколишнім світом.
          </p>
        </div>
      </div>
      <div class="block_pr">
        <div class="pr_lft">
          <img src="../assets/img/family_psu.svg" alt="family" />
          <h5>Спеціаліст: 1 800 грн</h5>
          <h5>Провідний спеціаліст: 2 300 грн</h5>
          <h3>Тривалість консультації: 85 хв</h3>
        </div>
        <div class="pr_rght">
          <h4>Сімейний психолог</h4>
          <div class="pr_lft_none">
            <img src="../assets/img/family_psu.svg" alt="family" />
            <h5>Спеціаліст: 1 800 грн</h5>
            <h5>Провідний спеціаліст: 2 300 грн</h5>
            <h3>Тривалість консультації: 85 хв</h3>
          </div>
          <p>
            Охолодження відносин, втома, непорозуміння, сварки, зради — ці
            проблеми можуть тривати роками. Можна просто чекати і сподіватися на
            краще, багато разів обіцяючи особисто собі та один одному що все
            зміниться, але ситуація повторюється знову і знову, що не призводить
            до вирішення проблеми. У кожній парі або сім’ї наступають складні
            періоди, вирішити які допоможе консультація з психологом.
          </p>
          <div class="sp">
            <span>Коли потрібно звертатися до сімейного психолога?</span>
          </div>
          <p>
            Чим довше триває складний період, тим більше накопичується образ і
            розчарувань, і тим складніше стає вирішувати конфлікти. Якщо ви
            відчуваєте, що в родині настає криза - це може бути сигналом до
            того, що варто звернутися по допомогу.
          </p>
          <div class="sp">
            <span>Чи справді сімейний психолог допоможе?</span>
          </div>

          <p>
            Більшість ситуацій не такі складні, якщо знати правильні методи для
            їх вирішення. Всього кілька зустрічей можуть допомогти обом
            партнерам зрозуміти, що вихід є, потрібно лише працювати у парі та
            навчитися прислуховуватись до думок один одного. Іноді потрібна
            більш тривала робота, але головна запорука успіху — ваше спільне
            бажання покращити стосунки. Сімейний психолог допоможе повернути
            втрачену довіру і взаєморозуміння.
          </p>
        </div>
      </div>
      <div class="block_pr">
        <div class="pr_lft">
          <img src="../assets/img/child.svg" alt="child" />
          <h5>Спеціаліст: 1 300 грн</h5>
          <h5>Провідний спеціаліст: 1 800 грн</h5>
          <h3>Тривалість консультації: 55 хв</h3>
        </div>
        <div class="pr_rght">
          <h4>Дитячий психолог</h4>
          <div class="pr_lft_none">
            <img src="../assets/img/child.svg" alt="child" />
            <h5>Спеціаліст: 1 300 грн</h5>
            <h5>Провідний спеціаліст: 1 800 грн</h5>
            <h3>Тривалість консультації: 55 хв</h3>
          </div>
          <p>
            Якщо ваша родина стикається з труднощами у спілкуванні з дитиною,
            можливо, вам потрібна допомога дитячого психолога. Крім консультацій
            з психологом, важливо, щоб саме ви активно брали участь у житті
            дитини та підтримували її у складні періоди. Важливо частіше гуляти
            разом, влаштовувати свята та грати, навіть якщо це складно
            організувати. Гра – це не просто розвага, а спосіб пізнання
            навколишнього світу і формування власного погляду. Вам необхідно
            брати активну участь у цьому процесі.
          </p>
          <div class="sp">
            <span>Що дитячий психолог запитує на першій консультації?</span>
          </div>
          <p>
            Під час першої консультації дитячий психолог зазвичай починає з
            ознайомчої бесіди та обговорення проблеми, з якою звернулися батьки,
            проводить опитування, і за допомогою тестування або гри дізнається
            потрібну інформацію. Батьки зазвичай заповнюють анкету з питаннями
            про розвиток дитини, стосунки у сім’ї, в школі або дитячому садку.
            Важливо давати повні та чесні відповіді. Вас можуть запитати про
            дату народження дитини, особливості вагітності та пологів, а також
            умови проживання та виховання. Хоча деякі питання можуть здаватися
            несуттєвими, у психології бувають ситуації, коли навіть найменші
            деталі можуть суттєво вплинути на виховання. Далі психолог інформує
            вас про кількість необхідних зустрічей для досягнення результату.
          </p>
          <div class="sp">
            <span
              >Як відбувається взаємодія батьків з психологом у процесі роботи з
              дитиною?</span
            >
          </div>

          <p>
            Якщо батьки погоджуються працювати і виконувати певні домашні
            завдання, психолог починає проводити консультації з дитиною за
            наступною схемою: декілька зустрічей з дитиною і одна з батьками. Ця
            зустріч потрібна для підведення проміжних підсумків і обговорення
            подальших кроків. За цей час у батьків зазвичай з’являються
            додаткові питання, які вони можуть обговорити з психологом для
            подальшого планування роботи.
          </p>
        </div>
      </div>
      <div class="block_pr">
        <div class="pr_lft">
          <img src="../assets/img/Grup.svg" alt="grup" />
          <h5>Вартість: 1 000 грн</h5>
          <h3>Тривалість консультації: 3 години</h3>
        </div>
        <div class="pr_rght">
          <h4>Групова терапія</h4>
          <div class="pr_lft_none">
            <img src="../assets/img/Grup.svg" alt="grup" />
            <h5>Вартість: 1 000 грн</h5>
            <h3>Тривалість консультації: 3 години</h3>
          </div>
          <p>
            Групова терапія є цінним інструментом психотерапії, що дозволяє
            отримати підтримку та зворотний зв'язок від людей, які справляються
            з подібними проблемами. Вона особливо корисна, коли людина відчуває
            ізольованість або самотність у своїх переживаннях. Це той самий
            додатковий ресурс, де можна проживати свої емоції разом з іншими.
          </p>
          <div class="sp">
            <span>Які проблеми та запити обговорюють у групі?</span>
          </div>
          <p>
            Не існує проблеми чи запиту, які було би неможливо обсудити на
            груповій терапії. Кожен учасник групи може поділитися своїм досвідом
            та зрозуміти, що він не самотній у своїх труднощах. Крім того, група
            може стати моделлю для побудови здорових відносин та місцем
            опанування нових навичок спілкування та взаємодії.
          </p>
          <div class="sp">
            <span
              >Як групова терапія працює у тандемі з індивідуальною
              терапією?</span
            >
          </div>
          <p>
            Поєднання групової та індивідуальної терапії може бути особливо
            ефективним. Індивідуальна терапія дозволяє детально опрацювати
            особисті проблеми та отримати глибше розуміння власних переживань.
            Групова терапія, у свою чергу, надає можливість отримувати підтримку
            та бачити себе очима інших людей. Таке поєднання методів дозволяє
            досягти більш комплексного та стійкого прогресу у терапевтичному
            процесі.
          </p>
          <div class="sp">
            <span>Який досвід надає групова терапія?</span>
          </div>
          <p>
            Групова терапія надає унікальні можливості для особистого зростання
            та розвитку і допомагає відчувати себе частиною спільноти, що
            підтримує та надихає. Вартно зауважити, що ресурс групи більший, ніж
            однієї людини і вона може витримати більшу кількість переживань
            одночасно.
          </p>
          <div class="sp">
            <span>Яку роль виконує психолог під час групових зустрічей?</span>
          </div>
          <p>
            Психолог встановлює правила у межах групи, фасілітує дискусії та
            забезпечує, щоб кожен мав можливість висловитися. Він також
            втручається у випадку конфліктів, допомагаючи їх конструктивно
            розв’язати. Психолог забезпечує зворотний зв'язок, допомагаючи
            учасникам краще зрозуміти свої емоції, поведінку та взаємодії,
            підтримує динаміку групи, сприяючи відкритому та чесному
            спілкуванню.
          </p>
        </div>
      </div>
    </div>
</template>

<script>
import { defineComponent, onMounted } from 'vue';

export default defineComponent({
  name: 'Price',
  mounted() {
    const burgerMenu = document.getElementById("burgerMenu");
      const menuOverlay = document.getElementById("menuOverlay");

      const toggleMenu = () => {
        menuOverlay.classList.toggle("open");
        burgerMenu.classList.toggle("open");
      };

      burgerMenu.addEventListener("click", toggleMenu);
      function checkTimeAndHideMessages() {
        const now = new Date();
        const currentHour = now.getHours();

        const elements = document.querySelectorAll(".message.operator");

        if (currentHour >= 20 || currentHour < 9) {
          elements.forEach((element) => {
            element.style.display = "none";
          });
        } else {
          elements.forEach((element) => {
            element.style.display = "";
          });
        }
      }

      checkTimeAndHideMessages();

      setInterval(checkTimeAndHideMessages, 60000);
  }
})
</script>

<style lang="scss" scoped>

</style>
